In [20]:
import numpy as np
import pandas as pd

<h2 style="color:#ffee58;"> I]üìùCreating DataFrames</h2>

- Multiple Series Combined together forms -> DataFrames


<h3 style="color:#27ae60;">üìÅ 1.Using Dictionary </h3>

=> we have provided column names(headers) as "name","Age","Department","Salary" [[Key]]]

In [21]:

data = {
    "Name": ["Amit", "Priya", "Rahul", "Sneha"],
    "Age": [25, 28, 22, 30],
    "Department": ["Data Analytics", "Marketing", "Finance", "HR"],
    "Salary": [50000, 55000, 48000, 60000]
}

# Creating DataFrame
df = pd.DataFrame(data)

print(df)
#Name is one series, Age is one series

    Name  Age      Department  Salary
0   Amit   25  Data Analytics   50000
1  Priya   28       Marketing   55000
2  Rahul   22         Finance   48000
3  Sneha   30              HR   60000


<h3 style="color:#27ae60;">üìÅ 2.Using Lists </h3>
=> we're not providing column name implicitly
=> headers default (0,1,2..)

In [22]:
# Sample list of lists 
data_list = [
    ["Amit", 25, "Data Analytics", 50000],
    ["Priya", 28, "Marketing", 55000],
    ["Rahul", 22, "Finance", 48000],
    ["Sneha", 30, "HR", 60000]
]
df2 = pd.DataFrame(data_list)
df2

       0   1               2      3
0   Amit  25  Data Analytics  50000
1  Priya  28       Marketing  55000
2  Rahul  22         Finance  48000
3  Sneha  30              HR  60000

<h6 style="color:#f39c12; font-size:22px;">üìùAdding column names Manually</h6>

In [26]:
#Adding column names Manually
df2= pd.DataFrame(data_list)
columns=["Name","Age","Department","Salary"]
df2= pd.DataFrame(data_list,columns=columns) #columns=>keyword argument
df2

    Name  Age      Department  Salary
0   Amit   25  Data Analytics   50000
1  Priya   28       Marketing   55000
2  Rahul   22         Finance   48000
3  Sneha   30              HR   60000

<h2 style="color:#ffee58;"> II]üìù Selection & Indexing of Columns </h2>

In [27]:
df2

    Name  Age      Department  Salary
0   Amit   25  Data Analytics   50000
1  Priya   28       Marketing   55000
2  Rahul   22         Finance   48000
3  Sneha   30              HR   60000

In [34]:
# df2[0] => wrong coz indexing doesn't work here we have to give names
df2['Name'] #DataFarme['target_column'] , like list

0     Amit
1    Priya
2    Rahul
3    Sneha
Name: Name, dtype: object

# Targeting two/more columns simultaneously => List of list [[]]

In [33]:
df[["Name","Age"]]

    Name  Age
0   Amit   25
1  Priya   28
2  Rahul   22
3  Sneha   30

<h2 style="color:#ffee58;"> III]üìù Creating new Columns </h2>

In [42]:
#column name and then give list 
df2["City"]=["Arizona","Nashik","Geneva","CSN"]
df2

    Name  Age      Department  Salary     City
0   Amit   25  Data Analytics   50000  Arizona
1  Priya   28       Marketing   55000   Nashik
2  Rahul   22         Finance   48000   Geneva
3  Sneha   30              HR   60000      CSN

<h2 style="color:#ffee58;"> IV]üìù Removing Columns Columns </h2>

In [ ]:
df2.drop('City' ) # error coz axis hasn't provided

In [45]:
df2.drop('City' , axis=1) #In a Pandas DataFrame, **`axis=0` refers to rows (vertical) here..0,1,2,3 and axis=1` refers to columns (horizontal) ..name , age , city....
# this makes only copy no change in original DB

    Name  Age      Department  Salary
0   Amit   25  Data Analytics   50000
1  Priya   28       Marketing   55000
2  Rahul   22         Finance   48000
3  Sneha   30              HR   60000

In [46]:
df2 # => shows it hasn't got removed from main data

    Name  Age      Department  Salary     City
0   Amit   25  Data Analytics   50000  Arizona
1  Priya   28       Marketing   55000   Nashik
2  Rahul   22         Finance   48000   Geneva
3  Sneha   30              HR   60000      CSN

In [47]:
df2.drop('City',axis=1,inplace=True) #to remove multiple thing's ["Name" , "Age"] like this
df2

    Name  Age      Department  Salary
0   Amit   25  Data Analytics   50000
1  Priya   28       Marketing   55000
2  Rahul   22         Finance   48000
3  Sneha   30              HR   60000

In [48]:
df2.drop(["Age","Salary"] , axis=1) #haven't added inplace coz permanent deletion will happen

    Name      Department
0   Amit  Data Analytics
1  Priya       Marketing
2  Rahul         Finance
3  Sneha              HR

In [49]:
df2

    Name  Age      Department  Salary
0   Amit   25  Data Analytics   50000
1  Priya   28       Marketing   55000
2  Rahul   22         Finance   48000
3  Sneha   30              HR   60000


<h4 style="color:#f39c12;">üìù deleting rows: ...</h4>

In [50]:
df2.drop(1,axis=0) #1th row removed temp , axis = 0 for rows

    Name  Age      Department  Salary
0   Amit   25  Data Analytics   50000
2  Rahul   22         Finance   48000
3  Sneha   30              HR   60000

In [51]:
df2

    Name  Age      Department  Salary
0   Amit   25  Data Analytics   50000
1  Priya   28       Marketing   55000
2  Rahul   22         Finance   48000
3  Sneha   30              HR   60000

<h2 style="color:#ffee58;">V]]üìùSelecting Rows</h2>

In [52]:
df2.loc[0] #loc=> location used for selecting rows

Name                    Amit
Age                       25
Department    Data Analytics
Salary                 50000
Name: 0, dtype: object

In [53]:
df2.loc[[0,2]]

    Name  Age      Department  Salary
0   Amit   25  Data Analytics   50000
2  Rahul   22         Finance   48000

In [54]:
df2.iloc[0]

Name                    Amit
Age                       25
Department    Data Analytics
Salary                 50000
Name: 0, dtype: object

<h2 style="color:#ffee58;">V]üìùSelecting Subsets of Rows & Columns</h2>

In [57]:
df.loc[[0,1]] [["Department","Salary"]] #0th 1th row and depart, sala. selected

       Department  Salary
0  Data Analytics   50000
1       Marketing   55000

<h2 style="color:#ffee58;">VI]üìùConditional Selection</h2>

In [58]:
# only want to see those people whose age is above 25
df2[df2 ["Age"]>25]

    Name  Age Department  Salary
1  Priya   28  Marketing   55000
3  Sneha   30         HR   60000

In [61]:
#age above 25 and Name is Amit => for more
df2[(df2["Age"]>25) & (df2["Name"] =="Amit")]

Empty DataFrame
Columns: [Name, Age, Department, Salary]
Index: []